{
  "id": "3",
  "post_date": "2018-03-03 10:30:00",
  "post_author": "1",
  "post_author_edited": null,
  "post_title": "Serverless: Focus on your business logic by using middleware.",
  "post_slug": "serverless-focus-on-your-business-logic-by-using-middleware",
  "post_content": "<p>It's easy to shoot yourself in the foot with serverless technologies.</p><p>We find ourselves in the serverless wild west without the opinionated guidance of a framework.</p><p>To give you some background, our team uses the serverless framework to build serverless APIs for our platform.</p><p>We use API Gateway in front of lambda functions which take incoming requests and return standardized HTTP responses.</p><p>A problem we find ourselves encountering is that we're trying to write the framework code you'd get from Express or Rails into each of our projects.</p><p>The logic for each of our endpoints within our serverless projects starts to get awfully repetitive. This takes us away from focussing on the code that matters to our business.</p><p>Recently our friends at <a target=\"_blank\" href=\"https://www.iopipe.com/\">IOPipe</a> recommended <a target=\"_blank\" href=\"https://github.com/middyjs/middy\">MiddyJS</a>, a middleware engine for AWS Lambda to help with this.</p><p>MiddyJS offers an engine that allows you to wrap your lambda function and abstract out the repetitive parts of your lambda functions into <a target=\"_blank\" href=\"https://github.com/middyjs/middy#how-it-works\">'before', 'after' and 'on error' hooks.</a></p><p>Any validation that you perform on the HTTP requests coming into your API can be moved out into a 'before' hook.</p><p>Similarly, instead of having to manually call the lambda callback when an error occurs you can simply throw the error and have one of MiddyJS's middleware's pick it up within an 'on error' hook.</p><p>Some middlewares we found to be useful have abstracted out all of the <a target=\"_blank\" href=\"https://github.com/middyjs/middy/blob/master/docs/middlewares.md#validator\">validation</a>, <a target=\"_blank\" href=\"https://github.com/middyjs/middy/blob/master/docs/middlewares.md#httperrorhandler\">error handling</a> and <a target=\"_blank\" href=\"https://github.com/middyjs/middy/blob/master/docs/middlewares.md#jsonbodyparser\">JSON parsing of the request.</a></p><p>You can also write your own middlewares which are <a target=\"_blank\" href=\"https://github.com/middyjs/middy#writing-a-middleware\">custom built to your needs.</a></p><p>This allowed us to slim down our lambda functions to only contain the business logic that we care about.</p><p><a target=\"_blank\" href=\"https://gist.github.com/lucasklaassen/d69a448a2b78f393f468a3064d3400de\">Here's an example of a lambda function</a> that includes that ability for <a target=\"_blank\" href=\"https://github.com/FidelLimited/serverless-plugin-warmup\">warmup</a>, request validation, error handling and JSON parsing of the request.</p><p>There are ways you could refactor this on its own and move out the different pieces into their own functions, files, etc.</p><p>That being said since there is no framework like Express or Rails available to us it's easy to find yourself in a situation like this when left unchecked.</p><p><a target=\"_blank\" href=\"https://gist.github.com/lucasklaassen/e05ac99d42f5c9b0b1d4c85164f8fa6d\">Here is another example,</a> but this time using MiddyJS middleware.</p><p>We've found that this pattern has reduced noise and promoted code reuse across our lambda functions.</p><p>Our team is on a mission to identify the ways in which other teams are protecting themselves against problems like these whilst utilizing serverless technologies.</p><p>If you have any comments or questions please reach out on the gist's provided or <a href=\"mailto:lucasklaassen1@gmail.com\">send me an email.</a></p>",
  "post_status": "published",
  "featured_image": null,
  "created_at": "2018-03-03 10:30:00",
  "updated_at": "2018-03-03 10:30:00",
  "author": {
    "id": "1",
    "firstname": "Lucas",
    "lastname": "Klaassen",
    "email": "lucasklaassen1@gmail.com",
    "profile_image": "https://media.licdn.com/mpr/mpr/shrinknp_400_400/p/5/005/0ac/295/228b398.jpg",
    "confirmed": "1",
    "confirmation_code": null,
    "created_at": "2018-03-03 10:30:00",
    "updated_at": "2018-03-03 10:30:00"
  }
}