{
  "id": "2",
  "post_date": "2017-12-31 10:30:00",
  "post_author": "1",
  "post_author_edited": null,
  "post_title": "Teaching myself to code and saving some money",
  "post_slug": "teaching-myself-to-code-and-saving-some-money",
  "post_content": "<p>Throughout my education, I tried to take a computer class every year because I really enjoyed them. Learning new things about technology was always fascinating to me. I was the tech guru in my small circle of friends and family.</p><p>In high school, a friend and I would spend a lot of time dreaming up different ways we could make money on the internet. One of our ideas was to set up a simple website on a free website builder and throw ads on it. We didn't know how to code but we would spend hours dragging and dropping on a WISYWIG, creating pages we thought would bring in viewers. The only \"ad clicks\" we would ever get were our own.</p><p>One of my Dad's high school friends worked for Microsoft and I remember asking him, \"What's an easy way to make money on the internet?\". I was looking for a get rich quick scheme but he told me, \"Use the internet as a resource and teach yourself to code\".</p><p>This seemed like a challenge I was unqualified for. I didn't read books much growing up; I couldn't stay focused. Whether it was a textbook or novel assigned for homework I would struggle to get through it. I would start to read something but then get lost in thought and not know what I just read. I didn't have the self-discipline to push through and try to train my mind to retain the information. While I was in school, James and the Giant Peach was the only book I read through entirely...</p><p>Although the thought of learning how to code was exciting, it felt quite far off in the distance. This was all true until I took an Internet class in grade 11. This class sparked the inception of my coding career. In this class, we were taught the basics of how file directories work and how a simple webpage is built. Once I learned how dead simple HTML was I got hooked. This class didn't push much past the basics of HTML/CSS but it gave me a platform to stand on.</p><p>I had the tools to start hacking away at building static web pages. Pairing this up with my drive to earn money on the internet I set foot on building my first website. A local business in our community needed a simple website and was willing to pay to have it made. Reading became a necessity for me and the more I learned the more I had fun. I would spend hours figuring out how to position elements in my browser to shape designs I had built in Photoshop. Late nights were my new home, I always had to finish a web page before going to bed.</p><p>After a year of coding static web pages and making a ton of mistakes, I wanted to go further with my understanding of programming. Learning JavaScript seemed very daunting to me and at this point, I didn't know what a \"for loop\" was. I remember watching a PHP video on lynda.com that introduced some basic programming concepts (variables, loops, functions). Some of these things started to make sense but I couldn't see how to do anything useful.</p><p>I took a look at free online code courses to see if any of them could enhance my knowledge about programming. <a target=\"_blank\" href=\"https://www.codecademy.com/\">Codecademy</a>, <a target=\"_blank\" href=\"https://www.codeschool.com/\">Code School</a> and <a target=\"_blank\" href=\"https://www.codewars.com/\">Code Wars</a> were a few that I used to learn the basics of programming. I started to copy and paste JavaScripts from other websites into my own static websites I had built to start creating more interactivity. Dropdown menus, button hovers, and page animations galore! I didn't understand how they all worked but this exercise started to damper the height of my learning curve.</p><p>I was able to find a job as a Front-end Web Developer where I spent my time translating photoshop files into HTML/CSS. This was astronomical in my career of becoming a programmer because now I had co-workers to learn from! I became friends with a few guys on the programming team there and they pointed me in the right direction for learning how to dive deeper into JavaScript and eventually into a back-end programming language.</p><p>If you want to start your own programming career you have to love sitting behind a computer screen for hours on end. <a target=\"_blank\" href=\"https://medium.com/learn-love-code/what-i-wish-i-knew-before-teaching-myself-how-to-code-402cc31d566a\">Here is a link to a blog post</a> that outlines a few things to be mindful of when starting out.</p><p>I would suggest learning the basics of HTML/CSS before anything else. The best way to learn it is to take a beginner course at one of the free online code schools I linked above. After you learn the basics, find a design online or make one up in photoshop and try and code it into HTML/CSS. The next step will be learning about responsive web design. <a target=\"_blank\" href=\"https://www.smashingmagazine.com/2011/01/guidelines-for-responsive-web-design/\">This article from 2011 still stands true.</a></p><p>Now you'll have a basic understanding of how things are displayed visually on the web. Your next best bet is to apply for a Junior Front-end Development job in your local area. Getting into a workplace full of experts in this field is the best way to learn more. Ask questions about everything, there are a lot of people who will happily share knowledge with someone who is passionate about learning how to code.</p><p>This field of work is always evolving and with all of the free resources available to us online, the need to go to school to learn how to code is not mandatory. If you can carve out the time to read, practice and put yourself out there into the internet industry, you'll most likely be able to find a home. If you have any followup questions or comments, <a href=\"mailto:lucasklaassen1@gmail.com\">send me an email.</a></p>",
  "post_status": "published",
  "featured_image": null,
  "created_at": "2017-12-31 10:30:00",
  "updated_at": "2017-12-31 10:30:00",
  "author": {
    "id": "1",
    "firstname": "Lucas",
    "lastname": "Klaassen",
    "email": "lucasklaassen1@gmail.com",
    "profile_image": "https://media.licdn.com/mpr/mpr/shrinknp_400_400/p/5/005/0ac/295/228b398.jpg",
    "confirmed": "1",
    "confirmation_code": null,
    "created_at": "2017-12-31 10:30:00",
    "updated_at": "2017-12-31 10:30:00"
  }
}