{
  "id": "4",
  "post_date": "2018-05-29 19:10:00",
  "post_author": "1",
  "post_author_edited": null,
  "post_title": "Angular 6 Rollbar Source Maps",
  "post_slug": "angular-6-rollbar-source-maps",
  "post_content": "<p><a target=\"_blank\" href=\"https://github.com/lucasklaassen/angular-rollbar-source-maps\">Link To Github Repo</a></p><p>Rollbar is a great tool that helps shead light on errors that occur within your code. However, when you minify your javascript code for deployment, it is hard to debug exceptions that arise in a production environment. <br><br> Luckily for us, <a target=\"_blank\" href=\"https://docs.rollbar.com/docs/source-maps\">Rollbar allows us to upload our javascript source maps</a> so that we can see metadata from the exception including the original source filename, line number, method name, and code snippet.</p><p>Unfortunately for us, Rollbar does not have a streamlined process for uploading these source maps within an Angular 6 deployment pipeline. There is a <a target=\"_blank\" href=\"https://github.com/thredup/rollbar-sourcemap-webpack-plugin\">webpack solution</a> but this requires you to use <pre>ng eject</pre> to gain access to make changes to the webpack configuration file.</p><p>I built a script that can loop through the javascript map files within your dist folder and upload them to Rollbar when you build your Angular 6 application. After the javascript source map files have been uploaded to Rollbar via their API, it wipes them out from the dist folder to prevent them from being deployed to production. (Although a user can deobfuscate your code without source maps, I recommend you always cover all of your bases)</p><p>If you have any followup questions or comments, <a href=\"mailto:lucasklaassen1@gmail.com\">send me an email.</a></p>",
  "post_status": "published",
  "featured_image": null,
  "created_at": "2018-05-29 19:10:00",
  "updated_at": "2018-05-29 19:10:00",
  "author": {
    "id": "1",
    "firstname": "Lucas",
    "lastname": "Klaassen",
    "email": "lucasklaassen1@gmail.com",
    "profile_image": "https://media.licdn.com/mpr/mpr/shrinknp_400_400/p/5/005/0ac/295/228b398.jpg",
    "confirmed": "1",
    "confirmation_code": null,
    "created_at": "2018-05-29 19:10:00",
    "updated_at": "2018-05-29 19:10:00"
  }
}